In [558]:
import pandas as pd
import numpy as np
import sklearn as skl 
import matplotlib.pyplot as plt

In [559]:
df = pd.read_csv('insurance.csv')

In [560]:
df.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [561]:
df.isnull().sum() # there is no null value

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64

In [562]:
df1=df.copy()
df2=df.copy()
df3=df.copy()
df4=df.copy()
df5=df.copy()
df6=df.copy()
df7=df.copy()
df8=df.copy()
df9=df.copy()

# 1.replace techniques without Encoding formula

In [563]:
df.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [564]:
df.sex.unique()

array(['female', 'male'], dtype=object)

In [565]:
df.smoker.unique()

array(['yes', 'no'], dtype=object)

In [566]:
df.region.unique()

array(['southwest', 'southeast', 'northwest', 'northeast'], dtype=object)

In [567]:
df.sex = df.sex.replace(['female', 'male'],[0,1])
df.smoker =df.smoker.replace(['yes','no'],[1,2])
df.region = df.region.replace(['southwest', 'southeast', 'northwest', 'northeast'],[1,2,3,4])

In [568]:
df.head()

   age  sex     bmi  children  smoker  region      charges
0   19    0  27.900         0       1       1  16884.92400
1   18    1  33.770         1       2       2   1725.55230
2   28    1  33.000         3       2       2   4449.46200
3   33    1  22.705         0       2       3  21984.47061
4   32    1  28.880         0       2       3   3866.85520

# 2.Label incoder Technuque

In [569]:
df1.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [570]:
from sklearn.preprocessing import LabelEncoder

In [571]:
le = LabelEncoder()

In [572]:
df1['sex'] =le.fit_transform(df1['sex'])
df1.smoker =le.fit_transform(df1['smoker'])
df1.region = le.fit_transform(df1.region)

In [573]:
df1.head()

   age  sex     bmi  children  smoker  region      charges
0   19    0  27.900         0       1       3  16884.92400
1   18    1  33.770         1       0       2   1725.55230
2   28    1  33.000         3       0       2   4449.46200
3   33    1  22.705         0       0       1  21984.47061
4   32    1  28.880         0       0       1   3866.85520

# Label incoder using for loop

In [574]:
df2.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [575]:
from pandas.core.dtypes.common import is_numeric_dtype

In [576]:
for col in df2.columns:
    if is_numeric_dtype(df2[col]):
        continue
        
    df2[col] =le.fit_transform(df2[col])

In [577]:
df2.head()

   age  sex     bmi  children  smoker  region      charges
0   19    0  27.900         0       1       3  16884.92400
1   18    1  33.770         1       0       2   1725.55230
2   28    1  33.000         3       0       2   4449.46200
3   33    1  22.705         0       0       1  21984.47061
4   32    1  28.880         0       0       1   3866.85520

# 3.One hot Techniques

In [578]:
#SEX COLUMNS

In [579]:
df3.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [580]:
dummy = pd.get_dummies(df3.sex)

In [581]:
dummy.head()

   female  male
0       1     0
1       0     1
2       0     1
3       0     1
4       0     1

In [582]:
df3.drop('sex',axis = 1,inplace = True)

In [583]:
df3.head()

   age     bmi  children smoker     region      charges
0   19  27.900         0    yes  southwest  16884.92400
1   18  33.770         1     no  southeast   1725.55230
2   28  33.000         3     no  southeast   4449.46200
3   33  22.705         0     no  northwest  21984.47061
4   32  28.880         0     no  northwest   3866.85520

# Dummy trap

In [584]:
dummy1 = pd.get_dummies(df4['sex'],drop_first = True,prefix='new')

In [585]:
dummy1.head()

   new_male
0         0
1         1
2         1
3         1
4         1

In [586]:
df5.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [587]:
df5 = pd.concat([df5, dummy1],axis = 1)

In [588]:
df5.head()

   age     sex     bmi  children smoker     region      charges  new_male
0   19  female  27.900         0    yes  southwest  16884.92400         0
1   18    male  33.770         1     no  southeast   1725.55230         1
2   28    male  33.000         3     no  southeast   4449.46200         1
3   33    male  22.705         0     no  northwest  21984.47061         1
4   32    male  28.880         0     no  northwest   3866.85520         1

# One hot encoding using loop

In [589]:
#sex COLUMNS

In [590]:
df6.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [591]:
columns = ['sex']

In [592]:
for col in columns:
    one_hot = pd.get_dummies(df6[col],drop_first = True, prefix = 'dummy') #1st line create "DUMMY" and drop "1st DUMMY COLUMN"
    df6 = pd.concat([df6 , one_hot],axis = 1).drop(col,axis=1)           # also drop "sex" colum.

In [593]:
df6.head()

   age     bmi  children smoker     region      charges  dummy_male
0   19  27.900         0    yes  southwest  16884.92400           0
1   18  33.770         1     no  southeast   1725.55230           1
2   28  33.000         3     no  southeast   4449.46200           1
3   33  22.705         0     no  northwest  21984.47061           1
4   32  28.880         0     no  northwest   3866.85520           1

In [595]:
#SMOKER COLUMNS

In [596]:
columns = ['smoker']

In [597]:
for col in columns:
    one_hot = pd.get_dummies(df6[col],drop_first = True, prefix = 'dummy') 
    df6 = pd.concat([df6 , one_hot],axis = 1).drop(col,axis=1)

In [598]:
df6.head()

   age     bmi  children     region      charges  dummy_male  dummy_yes
0   19  27.900         0  southwest  16884.92400           0          1
1   18  33.770         1  southeast   1725.55230           1          0
2   28  33.000         3  southeast   4449.46200           1          0
3   33  22.705         0  northwest  21984.47061           1          0
4   32  28.880         0  northwest   3866.85520           1          0

In [600]:
#REGION COLUMNS

In [601]:
columns = ['region']

In [602]:
for col in columns:
    one_hot = pd.get_dummies(df6[col],drop_first=True,prefix = 'dummy')
    df6 = pd.concat([df6,one_hot],axis = 1).drop(col,axis = 1)

In [603]:
df6.head()

,age,bmi,children,charges,dummy_male,dummy_yes,dummy_northwest,dummy_southeast,dummy_southwest
0,19,27.900,0,16884.92400,0,1,0,0,1
1,18,33.770,1,1725.55230,1,0,0,1,0
2,28,33.000,3,4449.46200,1,0,0,1,0
3,33,22.705,0,21984.47061,1,0,1,0,0
4,32,28.880,0,3866.85520,1,0,1,0,0

# 4.Ordinal Encoder Techniques

In [604]:
# SEX COLUMNS

In [605]:
df7.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [606]:
gender = df7.sex.unique()
gender

array(['female', 'male'], dtype=object)

In [607]:
from sklearn.preprocessing import OrdinalEncoder

In [608]:
ordi = OrdinalEncoder(categories = [gender])

In [609]:
ordi

OrdinalEncoder(categories=[array(['female', 'male'], dtype=object)])

In [610]:
encoded_value = ordi.fit_transform(df7[['sex']])

In [611]:
encoded_value

array([[0.],
       [1.],
       [1.],
       ...,
       [0.],
       [0.],
       [0.]])

In [612]:
encoded = pd.DataFrame(encoded_value, columns = ['encoded_number'])

In [613]:
encoded.head()

   encoded_number
0             0.0
1             1.0
2             1.0
3             1.0
4             1.0

In [614]:
df7.sex = encoded['encoded_number']

In [615]:
df7.head()

   age  sex     bmi  children smoker     region      charges
0   19  0.0  27.900         0    yes  southwest  16884.92400
1   18  1.0  33.770         1     no  southeast   1725.55230
2   28  1.0  33.000         3     no  southeast   4449.46200
3   33  1.0  22.705         0     no  northwest  21984.47061
4   32  1.0  28.880         0     no  northwest   3866.85520

In [616]:
#SMOKER COLUMNS

In [617]:
smoke = df7.smoker.unique()
smoke

array(['yes', 'no'], dtype=object)

In [618]:
from sklearn.preprocessing import OrdinalEncoder

In [619]:
ordi1 = OrdinalEncoder(categories=[smoke])

In [620]:
ordi1

OrdinalEncoder(categories=[array(['yes', 'no'], dtype=object)])

In [621]:
encoded_value = ordi1.fit_transform(df7[['smoker']])
encoded_value

array([[0.],
       [1.],
       [1.],
       ...,
       [1.],
       [1.],
       [0.]])

In [622]:
encoded = pd.DataFrame(encoded_value, columns= ['encoded_number'])

In [623]:
encoded.head()

   encoded_number
0             0.0
1             1.0
2             1.0
3             1.0
4             1.0

In [624]:
df7.smoker = encoded['encoded_number']

In [625]:
df7.head()

   age  sex     bmi  children  smoker     region      charges
0   19  0.0  27.900         0     0.0  southwest  16884.92400
1   18  1.0  33.770         1     1.0  southeast   1725.55230
2   28  1.0  33.000         3     1.0  southeast   4449.46200
3   33  1.0  22.705         0     1.0  northwest  21984.47061
4   32  1.0  28.880         0     1.0  northwest   3866.85520

In [626]:
#REGION COLUMNS

In [627]:
direction = df7.region.unique()
direction

array(['southwest', 'southeast', 'northwest', 'northeast'], dtype=object)

In [628]:
from sklearn.preprocessing import OrdinalEncoder

In [629]:
ordi2= OrdinalEncoder(categories = [direction])

In [630]:
ordi2

OrdinalEncoder(categories=[array(['southwest', 'southeast', 'northwest', 'northeast'], dtype=object)])

In [631]:
encoded_value =ordi2.fit_transform(df7[['region']])

In [632]:
encoded = pd.DataFrame(encoded_value,columns = ['encoded_number'])

In [633]:
encoded.head()

   encoded_number
0             0.0
1             1.0
2             1.0
3             2.0
4             2.0

In [634]:
df7.region = encoded.encoded_number

In [635]:
df7.head()

   age  sex     bmi  children  smoker  region      charges
0   19  0.0  27.900         0     0.0     0.0  16884.92400
1   18  1.0  33.770         1     1.0     1.0   1725.55230
2   28  1.0  33.000         3     1.0     1.0   4449.46200
3   33  1.0  22.705         0     1.0     2.0  21984.47061
4   32  1.0  28.880         0     1.0     2.0   3866.85520

# Thank you for watching